#Напишіть програму, яка отримує три цілих числа, введені з клавіатури (кожне число вводиться на окремому рядку), 
#і друкує на екрані їх суму, добуток, результат піднесення першого числа до степеня різниці другого і третього чисел.

# Введення першого числа
num1 = int(input("Введіть перше число: "))

# Введення другого числа
num2 = float(input("Введіть друге число: "))

# Введення третього числа
num3 = float(input("Введіть третє число: "))


sum = num1+num2+num3
dob = num1*num2*num3
st = num1**(num2-num3)

# Виведення введених чисел
print(sum, dob, st, sep="\n")