


#За правилами числа округлюються до найближчого цілого числа, а якщо дробова частина числа дорівнює 0.5, то число округляється вгору. 
# Дано невід’ємне число a, яке необхідно округлити за цими правилами. Зверніть увагу, що функція round() не годиться для цього завдання! 
# Використовувати розгалуження, цикли, математичний модуль math не можна.

def custom_round(a):
    # Відділяємо цілу частину від дробової
    integer_part = int(a)
    fractional_part = a - integer_part

    # Розраховуємо результат
    result = integer_part + (fractional_part >= 0.5)

    return result

# Вхідні дані
inputs = [2.5, 5.4, 56.87]

# Обробка кожного зразка
for a in inputs:
    print(custom_round(a))


#or

# def custom_round(a):
#     # Додаємо 0.5 до числа і відкидаємо дробову частину
#     return int(a + 0.5)


# # Вхідні дані
# inputs = [2.5, 5.4, 56.87]

# # Обробка кожного зразка
# for a in inputs:
#     print(custom_round(a))

