# Дано чотиризначне число. Визначте, чи є його десятковий запис симетричним. Якщо число симетричне, то виведіть 1, інакше виведіть будь-яке інше ціле число. 
# Число може мати менше чотирьох знаків, тоді потрібно вважати, що його десятковий запис доповнюється зліва нулями.

def is_symmetric(num):
    # Перетворення числа на рядок з доповненням нулями зліва до 4 знаків
    str_num = str(num).zfill(4)
    
    # Перевірка симетрії
    if str_num[0] == str_num[3] and str_num[1] == str_num[2]:
        return 1  # Число симетричне
    else:
        return 0  # Число не симетричне

# Приклад використання
number = int(input("Введіть чотиризначне число: "))
result = is_symmetric(number)
print(result)
